{
    "home": {
        "title": "Francesco Rossetti",
        "subtitle": "Full Stack Developer"
    },

    "menu": {
        "toplevel": "Pages",
        "home": "Home",
        "education": "Education",
        "experiences": "Experiences",
        "skills": "Skills",
        "certifications": "Certifications",
        "projects": "Projects"
    },


    "education": {
        "education": "EDUCATION",
        "sub": "MY ACADEMIC BACKGROUND",

        "unipr_institution": "Università degli Studi di Parma - Parma (PR)",
        "unipr_degree": "BACHELOR'S DEGREE IN COMPUTER ENGINEERING",
        "unipr_period": "2018 - 2023",
        "unipr_thesis_abstract": "",

        "isii_institution": "ISII G. Marconi - Piacenza (PC)",
        "isii_degree": "HIGH SCHOOL DIPLOMA IN COMPUTER SCIENCE",
        "isii_period": "2013 - 2018",
        "isii_thesis_abstract": ""
    },

    "experience": {
        "experience": "ESPERIENZE",
        "sub": "IL MIO PERCORSO LAVORATIVO",

        "ePol-title": "e-Pol S.R.L.",
        "ePol-period": "Ottobre 2024 - Presente",
        "ePol-position": "Sviluppatore Full Stack",
        "ePol-description": "Sviluppo di applicazioni web per la gestione di processi aziendali.",

        "latitudo-title": "Latitudo S.R.L.",
        "latitudo-period": "Aprile 2023 - Settembre 2024",
        "latitudo-position": "Sviluppatore Full Stack",
        "latitudo-description": "Attività di sviluppo/rifacimento di applicazioni WEB utilizzando lo stack Vue.JS e .NET 6. Sviluppo e manutenzione di script Python. Nel 2021 durante il tirocinio Universitario è stata creata una vista personalizzata per la suite Microsoft Power BI utilizzando le API fornite e React.",

        "baleraortica-title": "LA BALERA DELL'ORTICA",
        "baleraortica-period": "Marzo 2022 - Settembre 2022",
        "baleraortica-position": "Sviluppatore Full Stack",
        "baleraortica-description": "La collaborazione prevedeva la creazione di una piattaforma di prenotazione alle lezioni di ballo dell'azienda.",

        "brainfarm-title": "BRAINFARM Soc. Coop.",
        "brainfarm-period": "Giugno 2021 - Ottobre 2021",
        "brainfarm-position": "Tecnico di Help Desk",
        "brainfarm-description": "Assistenza tecnica e manutenzione hardware e software presso la Provincia di Piacenza.",

        "studiolarosadance-title": "STUDIO LAROSA DANCE",
        "studiolarosadance-period": "Dicembre 2019 - Settembre 2020",
        "studiolarosadance-position": "Sviluppatore Full Stack",
        "studiolarosadance-description": "Attività di creazione di un sito web per un'impresa sportiva. Il progetto è stato realizzato tramite il tema WordPress, Avada e i plugin grafici. Al progetto originale è stato aggiunto in un secondo tempo una piattaforma di prenotazione alle lezioni di ballo dell'azienda. Il progetto è stato svolto come attività secondaria durante gli studi universitari.",

        "hes-title": "H&S QUALITÀ NEL SOFTWARE S.P.A.",
        "hes-period": "Luglio 2018 - Settembre 2018",
        "hes-position": "SVILUPPATORE FULL STACK",
        "hes-description": "Attività di creazione di piattaforme CRM personalizzate per il workflow di vari clienti. Sono stati utilizzati diversi linguaggi tra cui C# nella sua componente web (ASP.NET con EXT.NET), mobile (XAMARIN) e SQL.",

        "amada-title": "AMADA S.P.A.",
        "amada-period": "Luglio 2017 - Settembre 2017",
        "amada-position": "Tecnico di Help Desk",
        "amada-description": "Assistenza tecnica e manutenzione hardware e software presso la sede di Piacenza."
    },

    "skill": {
        "skill": "SKILLS",
        "sub": "PROGRAMMING LANGUAGES AND FRAMEWORKS",

        "angular-title": "Angular",
        "angular-image": "angular.png",
        "angular-description": "Self-taught. I have used Angular in the development of medium to high complexity applications. By leveraging Angular's powerful framework, I structured the application using components, facilitating code organization and maintenance. Angular's two-way data binding and declarative templates improved the interactivity and responsiveness of the application. Angular's integrated Router simplified navigation management, allowing smooth transitions between different views.",

        "vue-title": "Vue.JS",
        "vue-image": "vue.png",
        "vue-description": "I have used Vue.js in the development of medium to high complexity single page applications (SPA). By leveraging Vue's modular structure, I organized the code into reusable components, simplifying project management and maintenance. The use of Vue's directives and data binding system made the interface dynamic and responsive, improving the user experience. Additionally, the integration of Vue Router facilitated navigation management within the application, allowing smooth transitions between different views.",

        "flutter-title": "Flutter",
        "flutter-image": "flutter.png",
        "flutter-description": "Self-taught. A framework for writing powerful applications on Android, iOS, and Web platforms. I appreciated it for its ease of learning, modularity, and the very active community that develops all kinds of extensions to meet every need. I used it to create small to medium complexity applications, leveraging its powerful UI toolkit to create attractive and responsive user interfaces.",

        "csharp-title": "C#",
        "csharp-image": "csharp.png",
        "csharp-description": "Programming language learned at school. I know how to apply language features such as lambda, delegates, classes, interfaces, inheritance, and integration with Entity Framework to add one or more databases within a project. I have used the .NET framework to create web applications with ASP.NET and Blazor, desktop applications with WPF and UWP, mobile applications with Xamarin, and game applications with Unity.",

        "laravel-title": "Laravel",
        "laravel-image": "laravel.png",
        "laravel-description": "Self-taught. Used both in its frontend and backend components with the development of Web APIs. I appreciated its simplicity in database operations and at the same time its complete and secure structure in the authentication phases.",

        "python-title": "Python",
        "python-image": "python.png",
        "python-description": "I learned Python in a university setting and know its advanced features, including lambda, decorators, classes, interfaces, and inheritance. I have experience integrating with Flask, FastAPI and SQLAlchemy for web application development and using the language for training neural networks applied to Computer Vision.",

        "sql-title": "SQL",
        "sql-image": "sql.png",
        "sql-description": "I have used it in the following variants: MySQL, Microsoft SQL Server, and SQLite. I know the key components for writing table structures given an Entity Relationship (ER) schema as well as inserting, updating, and deleting data within them. I know how to create views and stored procedures. I have used SQL to create complex queries for extracting data from multiple tables and for creating reports."
    },

    "certification": {
        "certification": "CERTIFICATIONS",
        "sub": "MY CERTIFICATIONS",
        "learnmore": "Learn more",

        "certification.az104-title": "AZ-104: Microsoft Azure Administrator",
        "certification.az104-dates": "March 2024",
        "certification.az104-url": "https://learn.microsoft.com/en-us/credentials/certifications/azure-administrator/",
        "certification.az104-description": "The AZ-104 exam certifies the skills required to manage Microsoft Azure cloud services, including core compute, network, storage, and security services. Azure administrators are responsible for implementing, managing, and monitoring identities, governance, storage, virtual compute resources, and networks in a cloud environment. This exam verifies the ability to configure and manage virtual networks, monitor and troubleshoot Azure resources, implement backup and recovery solutions, and manage identity and access security.",

        "certification.az900-title": "AZ-900: Microsoft Azure Fundamentals",
        "certification.az900-dates": "March 2023",
        "certification.az900-url": "https://learn.microsoft.com/en-us/credentials/certifications/azure-fundamentals/",
        "certification.az900-description": "The AZ-900 exam certifies fundamental knowledge of Microsoft Azure cloud services. It is aimed at anyone who wants to start working with Microsoft's cloud. The exam covers basic cloud concepts, core Azure services, security, privacy, compliance, and trust principles, as well as Azure pricing and support. This exam verifies the understanding of cloud computing concepts, deployment models, and the services offered by Azure.",

        "certification.sc900-title": "SC-900: Microsoft Security, Compliance, and Identity Fundamentals",
        "certification.sc900-dates": "November 2021",
        "certification.sc900-url": "https://learn.microsoft.com/en-us/credentials/certifications/security-compliance-and-identity-fundamentals",
        "certification.sc900-description": "The SC-900 exam certifies fundamental knowledge of security, compliance, and identity in Microsoft 365 and Azure. It is aimed at anyone who wants to start working with security, compliance, and identity in the cloud, regardless of technical role. The exam covers basic concepts of security, compliance, and identity, as well as security, privacy, compliance, and trust principles. This exam verifies the understanding of security, compliance, and identity concepts in the cloud.",

        "certification.ai900-title": "AI-900: Microsoft Azure AI Fundamentals",
        "certification.ai900-dates": "April 2021",
        "certification.ai900-url": "https://learn.microsoft.com/en-us/credentials/certifications/azure-ai-fundamentals/",
        "certification.ai900-description": "The AI-900 exam certifies fundamental knowledge of artificial intelligence (AI) and machine learning (ML) in Microsoft Azure. It is aimed at anyone who wants to start working with AI and ML in Azure. The exam covers basic concepts of AI and ML, core Azure services for AI and ML, security, privacy, compliance, and trust principles, as well as Azure pricing and support. This exam verifies the understanding of AI and ML concepts in the cloud."
    }
}
