{
    "home": {
        "title": "Francesco Rossetti",
        "subtitle": "Sviluppatore Full Stack"
    },

    "menu": {
        "toplevel": "Pagine",
        "home": "Home",
        "education": "Educazione",
        "experiences": "Esperienze",
        "skills": "Skills",
        "certifications": "Certificazioni",
        "projects": "Progetti"
    },

    "education": {
        "education": "EDUCAZIONE",
        "sub": "IL MIO PERCORSO DI STUDI",

        "unipr_institution": "Università degli Studi di Parma - Parma (PR)",
        "unipr_degree": "LAUREA TRIENNALE IN INGEGNERIA INFORMATICA",
        "unipr_period": "2018 - 2023",
        "unipr_thesis_abstract": " ",

        "isii_institution": "ISII G. Marconi - Piacenza (PC)",
        "isii_degree": "DIPLOMA CON LA QUALIFICA DI CAPOTECNICO IN INFORMATICA",
        "isii_period": "2013 - 2018",
        "isii_thesis_abstract": " "
    },

    "experience": {
        "experience": "ESPERIENZE",
        "sub": "IL MIO PERCORSO LAVORATIVO",

        "ePol-title": "e-Pol S.R.L.",
        "ePol-period": "Ottobre 2024 - Presente",
        "ePol-position": "Sviluppatore Full Stack",
        "ePol-description": "Sviluppo di applicazioni web per la gestione di processi aziendali.",

        "latitudo-title": "Latitudo S.R.L.",
        "latitudo-period": "Aprile 2023 - Settembre 2024",
        "latitudo-position": "Sviluppatore Full Stack",
        "latitudo-description": "Attività di sviluppo/rifacimento di applicazioni WEB utilizzando lo stack Vue.JS e .NET 6. Sviluppo e manutenzione di script Python. Nel 2021 durante il tirocinio Universitario è stata creata una vista personalizzata per la suite Microsoft Power BI utilizzando le API fornite e React.",

        "baleraortica-title": "LA BALERA DELL'ORTICA",
        "baleraortica-period": "Marzo 2022 - Settembre 2022",
        "baleraortica-position": "Sviluppatore Full Stack",
        "baleraortica-description": "La collaborazione prevedeva la creazione di una piattaforma di prenotazione alle lezioni di ballo dell'azienda.",

        "brainfarm-title": "BRAINFARM Soc. Coop.",
        "brainfarm-period": "Giugno 2021 - Ottobre 2021",
        "brainfarm-position": "Tecnico di Help Desk",
        "brainfarm-description": "Assistenza tecnica e manutenzione hardware e software presso la Provincia di Piacenza.",

        "studiolarosadance-title": "STUDIO LAROSA DANCE",
        "studiolarosadance-period": "Dicembre 2019 - Settembre 2020",
        "studiolarosadance-position": "Sviluppatore Full Stack",
        "studiolarosadance-description": "Attività di creazione di un sito web per un'impresa sportiva. Il progetto è stato realizzato tramite il tema WordPress, Avada e i plugin grafici. Al progetto originale è stato aggiunto in un secondo tempo una piattaforma di prenotazione alle lezioni di ballo dell'azienda. Il progetto è stato svolto come attività secondaria durante gli studi universitari.",

        "hes-title": "H&S QUALITÀ NEL SOFTWARE S.P.A.",
        "hes-period": "Luglio 2018 - Settembre 2018",
        "hes-position": "SVILUPPATORE FULL STACK",
        "hes-description": "Attività di creazione di piattaforme CRM personalizzate per il workflow di vari clienti. Sono stati utilizzati diversi linguaggi tra cui C# nella sua componente web (ASP.NET con EXT.NET), mobile (XAMARIN) e SQL.",

        "amada-title": "AMADA S.P.A.",
        "amada-period": "Luglio 2017 - Settembre 2017",
        "amada-position": "Tecnico di Help Desk",
        "amada-description": "Assistenza tecnica e manutenzione hardware e software presso la sede di Piacenza."
    },

    "skill": {
        "skill": "SKILLS",
        "sub": "LINGUAGGI DI PROGRAMMAZIONE E FRAMEWORK",

        "angular-title": "Angular",
        "angular-image": "angular.png",
        "angular-description": "Imparato da autodidatta. Ho utilizzato Angular nello sviluppo di applicazioni di complessità medio-alta. Sfruttando il potente framework di Angular, ho strutturato l'applicazione utilizzando i componenti, facilitando l'organizzazione e la manutenzione del codice. Il two-way data binding e i template dichiarativi di Angular hanno migliorato l'interattività e la reattività dell'applicazione. Il Router integrato di Angular ha semplificato la gestione della navigazione, consentendo transizioni fluide tra le diverse viste.",

        "vue-title": "Vue.JS",
        "vue-image": "vue.png",
        "vue-description": "Ho impiegato Vue.js nello sviluppo di applicazioni single page (SPA) di medio-alta complessità. Sfruttando la struttura modulare di Vue, ho organizzato il codice in componenti riutilizzabili, semplificando la gestione e la manutenzione del progetto. L'uso delle direttive di Vue e del sistema di binding dei dati ha reso l'interfaccia dinamica e reattiva, migliorando l'esperienza utente. Inoltre, l'integrazione di Vue Router ha facilitato la gestione della navigazione all'interno dell'applicazione, consentendo una transizione fluida tra le diverse viste.",

        "flutter-title": "Flutter",
        "flutter-image": "flutter.png",
        "flutter-description": "Imparato da autodidatta. Framework per la scrittura di potenti applicazioni su piattaforme Android, iOS e Web. L'ho apprezzato per la sua facilità di apprendimento, la sua modularità e per la community molto attiva che sviluppa ogni tipo di estensione per soddisfare ogni esigenza. L'ho utilizzato per la creazione di applicazioni di piccola e media complessità, sfruttando la sua potente UI toolkit per creare interfacce utente accattivanti e reattive.",

        "csharp-title": "C#",
        "csharp-image": "csharp.png",
        "csharp-description": "Linguaggio di programmazione appreso a scuola. Conosco come applicare le funzionalità del linguaggio come lambda, delegates, classi, interfacce, ereditarietà e integrazione con Entity Framework per aggiungere una o più basi di dati all'interno di un progetto. Ho utilizzato il framework .NET per creare applicazioni web con ASP.NET e Blazor, applicazioni desktop con WPF e UWP, applicazioni mobile con Xamarin e applicazioni di gioco con Unity.",

        "laravel-title": "Laravel",
        "laravel-image": "laravel.png",
        "laravel-description": "Imparato da autodidatta. Utilizzato sia nella sua componente di frontend che nella sua componente di backend con lo sviluppo di Web API. Ho apprezzato la sua semplicità nelle operazioni di database e allo stesso tempo la sua struttura completa e sicura nelle fasi di autenticazione.",

        "python-title": "Python",
        "python-image": "python.png",
        "python-description": "Ho appreso Python in ambito universitario e conosco le sue funzionalità avanzate, tra cui lambda, decorators, classi, interfacce ed ereditarietà. Ho esperienza nell'integrazione con Flask, FastAPI e SQLAlchemy per lo sviluppo di applicazioni web e nell'utilizzo del linguaggio per l'addestramento di reti neurali applicate alla Computer Vision.",

        "sql-title": "SQL",
        "sql-image": "sql.png",
        "sql-description": "L'ho usato nelle seguenti varianti: MySQL, Microsoft SQL Server e SQLite. Conosco i componenti chiave per la scrittura della struttura di tabelle dato uno schema Entity Relationship (ER) nonché inserimenti, aggiornamenti ed eliminazioni di dati all'interno delle stesse. Conosco come creare views e stored procedures. Ho utilizzato SQL per creare query complesse per l'estrazione di dati da più tabelle e per la creazione di report."
    },

    "certification": {
        "certification": "CERTIFICAZIONI",
        "sub": "LE MIE CERTIFICAZIONI",
        "learnmore": "Scopri di più",

        "az104-title": "AZ-104: Microsoft Azure Administrator",
        "az104-dates": "Marzo 2024",
        "az104-url": "https://learn.microsoft.com/it-it/credentials/certifications/azure-administrator/",
        "az104-description": "L'esame AZ-104 certifica le competenze necessarie per gestire i servizi cloud di Microsoft Azure, inclusi i principali servizi di calcolo, rete, archiviazione e sicurezza. Gli amministratori Azure sono responsabili dell'implementazione, gestione e monitoraggio delle identità, della governance, dell'archiviazione, delle risorse di calcolo virtuali e delle reti in un ambiente cloud. Questo esame verifica la capacità di configurare e gestire reti virtuali, monitorare e risolvere i problemi relativi alle risorse Azure, implementare soluzioni di backup e ripristino e gestire la sicurezza delle identità e degli accessi.",

        "az900-title": "AZ-900: Microsoft Azure Fundamentals",
        "az900-dates": "Marzo 2023",
        "az900-url": "https://learn.microsoft.com/it-it/credentials/certifications/azure-fundamentals/",
        "az900-description": "L'esame AZ-900 certifica le conoscenze fondamentali dei servizi cloud di Microsoft Azure. È rivolto a chiunque desideri iniziare a lavorare con il cloud di Microsoft. L'esame copre concetti di base del cloud, i principali servizi di Azure, i principi di sicurezza, privacy, conformità e fiducia, nonché i prezzi e il supporto di Azure. Questo esame verifica la comprensione dei concetti di cloud computing, dei modelli di distribuzione e dei servizi offerti da Azure.",

        "sc900-title": "SC-900: Microsoft Security, Compliance, and Identity Fundamentals",
        "sc900-dates": "Novembre 2021",
        "sc900-url": "https://learn.microsoft.com/it-it/credentials/certifications/security-compliance-and-identity-fundamentals",
        "sc900-description": "L'esame SC-900 certifica le conoscenze fondamentali della sicurezza, della conformità e dell'identità in Microsoft 365 e Azure. È rivolto a chiunque desideri iniziare a lavorare con la sicurezza, la conformità e l'identità in cloud, indipendentemente dal ruolo tecnico. L'esame copre concetti di base della sicurezza, della conformità e dell'identità, nonché i principi di sicurezza, privacy, conformità e fiducia. Questo esame verifica la comprensione dei concetti di sicurezza, conformità e identità in cloud.",

        "ai900-title": "AI-900: Microsoft Azure AI Fundamentals",
        "ai900-dates": "Aprile 2021",
        "ai900-url": "https://learn.microsoft.com/it-it/credentials/certifications/azure-ai-fundamentals/",
        "ai900-description": "L'esame AI-900 certifica le conoscenze fondamentali dell'intelligenza artificiale (AI) e del machine learning (ML) in Microsoft Azure. È rivolto a chiunque desideri iniziare a lavorare con l'AI e il ML in Azure. L'esame copre concetti di base dell'AI e del ML, i principali servizi di Azure per l'AI e il ML, i principi di sicurezza, privacy, conformità e fiducia, nonché i prezzi e il supporto di Azure. Questo esame verifica la comprensione dei concetti di AI e ML in cloud."
    }
}
